; domain
(define (domain assignment_problem_1)
    (:requirements :strips :typing)

    (:types
        location ; defines a location
        work_station ; defines a work station
        box ; defines a box
        supply ; defines a general supply, will be extended
        robot ; defines a robot
        valve - supply
        bolt - supply
        tool - supply
        warehouse - location
        
        )
    (:constants
   
    )


    (:predicates
        
        (atwa ?x - warehouse ?l - location) ; Defines where the warehouse is
        (atws ?x - work_station ?l - location) ; Defines where the work station is
        (atbl ?x - box ?l - location) ; Defines where the box is
        (atbw ?x - box ?l - work_station) ; Defines where the box is
        (ats ?x - supply ?l - location) ; Defines where the supply is
        (atr ?x - robot ?l - location) ; Defines where the robot is
        (contains ?x - box ?y - supply) ; Defines what the box contains

        (has ?ws - work_station ?s - supply) ; Defines what the work station has
        (box_delivered ?b - box ?ws - work_station) ; Defines what boxes have been delivered to the work station


        (carries ?r - robot ?b - box) ; Defines what the robot carries

        (connected ?l1 - location ?l2 - location) ; Defines what locations are connected
        
        (free ?l - location)
        (loaded ?r - robot) ; defines if a robot is loaded
        (empty ?b - box) ; defines if a box is empty
        (has_bolt ?ws - work_station) ; defines if a work station has a bolt
        (has_tool ?ws - work_station) ; defines if a work station has a bolt
        (has_valve ?ws - work_station) ; defines if a work station has a bolt

        (is_bolt ?b - supply)
        (is_valve ?b - supply)
        (is_tool ?b - supply)

    
    )

    ; moves a robot from one location to another
    (:action move_robot
        :parameters (?r - robot ?l1 - location ?l2 - location)
        :precondition (and (atr ?r ?l1) (connected ?l1 ?l2) (free ?l2) (not (loaded ?r)))
        :effect (and  (not (free ?l2)) (free ?l1) (atr ?r ?l2) (not (atr ?r ?l1)))
    )

     (:action move_box_and_robot
        :parameters (?r - robot ?l1 - location ?l2 - location ?b - box)
        :precondition (and (atr ?r ?l1) (connected ?l1 ?l2) (free ?l2) (loaded ?r) (carries ?r ?b) )
        :effect (and  (not (free ?l2)) (free ?l1) (atr ?r ?l2) (not (atr ?r ?l1)) (atbl ?b ?l2) )
    )

    ; pick up a box
    (:action pick_box_from_wa
        :parameters (?r - robot ?b - box ?l - warehouse)
        :precondition (and (atr ?r ?l) (atbl ?b ?l) (not (loaded ?r)))
        :effect (and  (not (atbl ?b ?l)) (carries ?r ?b) (loaded ?r))
    )

    (:action deliver_box_to_ws
        :parameters (?r - robot ?b - box ?ws - work_station ?l - location ?s - supply)
        :precondition (and (atr ?r ?l) (atws ?ws ?l) (loaded ?r) (carries ?r ?b) (contains ?b ?s) )
        :effect (and (not(loaded ?r)) (not(carries ?r ?b)) (atbw ?b ?ws) (atbl ?b ?l) (box_delivered ?b ?ws) (ats ?s ?l) )
    )





    
    (:action fill_box
        :parameters (?r - robot ?b - box ?s - supply ?l - location) 
        :precondition (and (atbl ?b ?l) (atr ?r ?l) (empty ?b) (ats ?s ?l) )
        :effect (and (contains ?b ?s) (not (empty ?b)) (not (ats ?s ?l)))
    )


    (:action empty_box
        :parameters (?r - robot ?b - box ?s - supply ?l - location ?ws - work_station)
        :precondition (and (atr ?r ?l) (atws ?ws ?l) (contains ?b ?s) (ats ?s ?l) (box_delivered ?b ?ws) (ats ?s ?l) )
        :effect (and (not (contains ?b ?s)) (empty ?b) (has ?ws ?s) (not (ats ?s ?l)) )
    )

    (:action bolt_acquired
        :parameters (?ws - work_station ?s - supply)
        :precondition (and (has ?ws ?s) (is_bolt ?s))
        :effect (and (has_bolt ?ws))
    )
    
    (:action tool_acquired
        :parameters (?ws - work_station ?s - supply)
        :precondition (and (has ?ws ?s) (is_tool ?s))
        :effect (and (has_tool ?ws))
    )
    (:action valve_acquired
        :parameters (?ws - work_station ?s - supply)
        :precondition (and (has ?ws ?s) (is_valve ?s))
        :effect (and (has_valve ?ws))
    )
    


    
    


)

; problem
(define (problem problem_1) (:domain assignment_problem_1)
(:objects 
    r1 r2 r3 - robot
    l1 l2 l3 l4 l5 l6 - location
    centralwarehouse - warehouse
    b1 b2 b3 b4 b5 b6 - box
    valve1 valve2 valve3 valve4 valve5 valve6 - valve
    bolt1 bolt2 bolt3 bolt4 bolt5 bolt6 - bolt
    tool1 tool2 tool3 tool4 tool5 tool6 - tool
    ws1 ws2 ws3 ws4 ws5 ws6 ws7 ws8 ws9 ws10 - work_station

    )




   

(:init
    ; robot starts at central warehouse
    (atr r1 centralwarehouse)
    (atr r2 centralwarehouse)
    (atr r3 centralwarehouse)

    (free l1)
    (free l2)
    (free l3)
    (free l4)
    (free l5)
    (free l6)


    ; all supplies are at central warehouse
    (ats valve1 centralwarehouse)
    (ats valve2 centralwarehouse)
    (ats valve3 centralwarehouse)
    (ats valve4 centralwarehouse)
    (ats valve5 centralwarehouse)
    (ats valve6 centralwarehouse)
    (ats bolt1 centralwarehouse)
    (ats bolt2 centralwarehouse)
    (ats bolt3 centralwarehouse)
    (ats bolt4 centralwarehouse)
    (ats bolt5 centralwarehouse)
    (ats bolt6 centralwarehouse)
    (ats tool1 centralwarehouse)
    (ats tool2 centralwarehouse)
    (ats tool3 centralwarehouse)
    (ats tool4 centralwarehouse)
    (ats tool5 centralwarehouse)
    (ats tool6 centralwarehouse)
    (is_bolt bolt1)
    (is_bolt bolt2)
    (is_bolt bolt3)
    (is_bolt bolt4)
    (is_bolt bolt5)
    (is_bolt bolt6)
    (is_valve valve1)
    (is_valve valve2)
    (is_valve valve3)
    (is_valve valve4)
    (is_valve valve5)
    (is_valve valve6)
    (is_tool tool1)
    (is_tool tool2)
    (is_tool tool3)
    (is_tool tool4)
    (is_tool tool5)
    (is_tool tool6)






    ; all boxes are at central warehouse
    (atbl b1 centralwarehouse)
    (atbl b2 centralwarehouse)
    (atbl b3 centralwarehouse)
    (atbl b4 centralwarehouse)
    (atbl b5 centralwarehouse)
    (atbl b6 centralwarehouse)
    ; all boxes are empty
    (empty b1)
    (empty b2)
    (empty b3)
    (empty b4)
    (empty b5)
    (empty b6)

    ; create map
    (connected centralwarehouse l1)
    (connected centralwarehouse l2)
    (connected centralwarehouse l3)
    (connected l3 l4)
    (connected l4 l3)
    (connected l1 centralwarehouse)
    (connected l2 centralwarehouse)
    (connected l3 centralwarehouse)
    (connected l4 l5)
    (connected l5 l4)
    (connected l5 l6)
    (connected l6 l5)
    (connected l6 l1)
    (connected l1 l6)


    ; put workstation at location
    (atws ws1 l1)
    (atws ws2 l2)
    (atws ws3 l3)
    (atws ws4 l4)
    (atws ws5 l4)
    (atws ws6 l5)
    (atws ws7 l5)
    (atws ws8 l6)
    (atws ws9 l6)
    (atws ws10 l6)









)

(:goal (and

    (atr r1 centralwarehouse)
    (has_bolt ws3)
    (has_tool ws2)
    (has_bolt ws2)
    (has_valve ws1)
    (has_bolt ws5)
    (has_tool ws4)
    (has_bolt ws6)
    (has_tool ws6)
    (has_valve ws6)
    ;todo: put the goal condition here
))

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (fill_box r1 b1 tool1 centralwarehouse)
   deleted: (empty b1) (ats tool1 centralwarehouse)
   added: (contains b1 tool1)
   goals met: 1 of 10
2. (pick_box_from_wa r2 b1 centralwarehouse)
   deleted: (atbl b1 centralwarehouse)
   added: (carries r2 b1) (loaded r2)
   goals met: 1 of 10
3. (fill_box r1 b2 valve1 centralwarehouse)
   deleted: (empty b2) (ats valve1 centralwarehouse)
   added: (contains b2 valve1)
   goals met: 1 of 10
4. (pick_box_from_wa r3 b2 centralwarehouse)
   deleted: (atbl b2 centralwarehouse)
   added: (carries r3 b2) (loaded r3)
   goals met: 1 of 10
5. (fill_box r1 b3 bolt1 centralwarehouse)
   deleted: (empty b3) (ats bolt1 centralwarehouse)
   added: (contains b3 bolt1)
   goals met: 1 of 10
6. (pick_box_from_wa r1 b3 centralwarehouse)
   deleted: (atbl b3 centralwarehouse)
   added: (carries r1 b3) (loaded r1)
   goals met: 1 of 10
7. (move_box_and_robot r3 centralwarehouse l1 b2)
   deleted: (free l1) (atr r3 centralwarehouse)
   added: (free centralwarehouse) (atr r3 l1) (atbl b2 l1)
   goals met: 1 of 10
8. (move_box_and_robot r2 centralwarehouse l2 b1)
   deleted: (free l2) (atr r2 centralwarehouse)
   added: (atr r2 l2) (atbl b1 l2)
   goals met: 1 of 10
9. (move_box_and_robot r1 centralwarehouse l3 b3)
   deleted: (free l3) (atr r1 centralwarehouse)
   added: (atr r1 l3) (atbl b3 l3)
   goals met: 0 of 10
10. (deliver_box_to_ws r2 b1 ws2 l2 tool1)
   deleted: (loaded r2) (carries r2 b1)
   added: (atbw b1 ws2) (box_delivered b1 ws2) (ats tool1 l2)
   goals met: 0 of 10
11. (empty_box r2 b1 tool1 l2 ws2)
   deleted: (contains b1 tool1) (ats tool1 l2)
   added: (empty b1) (has ws2 tool1)
   goals met: 0 of 10
12. (deliver_box_to_ws r3 b2 ws1 l1 valve1)
   deleted: (loaded r3) (carries r3 b2)
   added: (atbw b2 ws1) (box_delivered b2 ws1) (ats valve1 l1)
   goals met: 0 of 10
13. (empty_box r3 b2 valve1 l1 ws1)
   deleted: (contains b2 valve1) (ats valve1 l1)
   added: (empty b2) (has ws1 valve1)
   goals met: 0 of 10
14. (tool_acquired ws2 tool1)
   added: (has_tool ws2)
   goals met: 1 of 10
15. (valve_acquired ws1 valve1)
   added: (has_valve ws1)
   goals met: 2 of 10
16. (move_box_and_robot r1 l3 centralwarehouse b3)
   deleted: (free centralwarehouse) (atr r1 l3)
   added: (free l3) (atr r1 centralwarehouse) (atbl b3 centralwarehouse)
   goals met: 3 of 10
17. (fill_box r1 b6 tool2 centralwarehouse)
   deleted: (empty b6) (ats tool2 centralwarehouse)
   added: (contains b6 tool2)
   goals met: 3 of 10
18. (fill_box r1 b4 valve2 centralwarehouse)
   deleted: (empty b4) (ats valve2 centralwarehouse)
   added: (contains b4 valve2)
   goals met: 3 of 10
19. (move_box_and_robot r1 centralwarehouse l3 b3)
   deleted: (free l3) (atr r1 centralwarehouse)
   added: (free centralwarehouse) (atr r1 l3)
   goals met: 2 of 10
20. (move_box_and_robot r1 l3 l4 b3)
   deleted: (free l4) (atr r1 l3)
   added: (free l3) (atr r1 l4) (atbl b3 l4)
   goals met: 2 of 10
21. (deliver_box_to_ws r1 b3 ws5 l4 bolt1)
   deleted: (loaded r1) (carries r1 b3)
   added: (atbw b3 ws5) (box_delivered b3 ws5) (ats bolt1 l4)
   goals met: 2 of 10
22. (move_robot r1 l4 l3)
   deleted: (free l3) (atr r1 l4)
   added: (free l4) (atr r1 l3)
   goals met: 2 of 10
23. (pick_box_from_wa r1 b3 l3)
   deleted: (atbl b3 l3)
   added: (carries r1 b3) (loaded r1)
   goals met: 2 of 10
24. (move_box_and_robot r1 l3 l4 b3)
   deleted: (free l4) (atr r1 l3)
   added: (free l3) (atr r1 l4)
   goals met: 2 of 10
25. (move_box_and_robot r1 l4 l3 b3)
   deleted: (free l3) (atr r1 l4)
   added: (free l4) (atr r1 l3) (atbl b3 l3)
   goals met: 2 of 10
26. (deliver_box_to_ws r1 b3 ws3 l3 bolt1)
   deleted: (loaded r1) (carries r1 b3)
   added: (atbw b3 ws3) (box_delivered b3 ws3) (ats bolt1 l3)
   goals met: 2 of 10
27. (empty_box r1 b3 bolt1 l3 ws3)
   deleted: (contains b3 bolt1) (ats bolt1 l3)
   added: (empty b3) (has ws3 bolt1)
   goals met: 2 of 10
28. (bolt_acquired ws3 bolt1)
   added: (has_bolt ws3)
   goals met: 3 of 10
29. (move_robot r1 l3 centralwarehouse)
   deleted: (free centralwarehouse) (atr r1 l3)
   added: (free l3) (atr r1 centralwarehouse)
   goals met: 4 of 10
30. (pick_box_from_wa r1 b6 centralwarehouse)
   deleted: (atbl b6 centralwarehouse)
   added: (carries r1 b6) (loaded r1)
   goals met: 4 of 10
31. (fill_box r1 b3 bolt2 centralwarehouse)
   deleted: (empty b3) (ats bolt2 centralwarehouse)
   added: (contains b3 bolt2)
   goals met: 4 of 10
32. (move_box_and_robot r1 centralwarehouse l3 b6)
   deleted: (free l3) (atr r1 centralwarehouse)
   added: (free centralwarehouse) (atr r1 l3) (atbl b6 l3)
   goals met: 3 of 10
33. (move_box_and_robot r1 l3 l4 b6)
   deleted: (free l4) (atr r1 l3)
   added: (free l3) (atr r1 l4) (atbl b6 l4)
   goals met: 3 of 10
34. (deliver_box_to_ws r1 b6 ws4 l4 tool2)
   deleted: (loaded r1) (carries r1 b6)
   added: (atbw b6 ws4) (box_delivered b6 ws4) (ats tool2 l4)
   goals met: 3 of 10
35. (pick_box_from_wa r1 b3 l4)
   deleted: (atbl b3 l4)
   added: (carries r1 b3) (loaded r1)
   goals met: 3 of 10
36. (move_box_and_robot r1 l4 l5 b3)
   deleted: (free l5) (atr r1 l4)
   added: (free l4) (atr r1 l5) (atbl b3 l5)
   goals met: 3 of 10
37. (move_box_and_robot r1 l5 l4 b3)
   deleted: (free l4) (atr r1 l5)
   added: (free l5) (atr r1 l4) (atbl b3 l4)
   goals met: 3 of 10
38. (deliver_box_to_ws r1 b3 ws4 l4 bolt2)
   deleted: (loaded r1) (carries r1 b3)
   added: (atbw b3 ws4) (box_delivered b3 ws4) (ats bolt2 l4)
   goals met: 3 of 10
39. (move_robot r1 l4 l3)
   deleted: (free l3) (atr r1 l4)
   added: (free l4) (atr r1 l3)
   goals met: 3 of 10
40. (move_robot r1 l3 centralwarehouse)
   deleted: (free centralwarehouse) (atr r1 l3)
   added: (free l3) (atr r1 centralwarehouse)
   goals met: 4 of 10
41. (pick_box_from_wa r1 b4 centralwarehouse)
   deleted: (atbl b4 centralwarehouse)
   added: (carries r1 b4) (loaded r1)
   goals met: 4 of 10
42. (move_box_and_robot r1 centralwarehouse l3 b4)
   deleted: (free l3) (atr r1 centralwarehouse)
   added: (free centralwarehouse) (atr r1 l3) (atbl b4 l3)
   goals met: 3 of 10
43. (move_box_and_robot r1 l3 l4 b4)
   deleted: (free l4) (atr r1 l3)
   added: (free l3) (atr r1 l4) (atbl b4 l4)
   goals met: 3 of 10
44. (move_box_and_robot r1 l4 l5 b4)
   deleted: (free l5) (atr r1 l4)
   added: (free l4) (atr r1 l5) (atbl b4 l5)
   goals met: 3 of 10
45. (deliver_box_to_ws r1 b4 ws6 l5 valve2)
   deleted: (loaded r1) (carries r1 b4)
   added: (atbw b4 ws6) (box_delivered b4 ws6) (ats valve2 l5)
   goals met: 3 of 10
46. (pick_box_from_wa r1 b3 l5)
   deleted: (atbl b3 l5)
   added: (carries r1 b3) (loaded r1)
   goals met: 3 of 10
47. (deliver_box_to_ws r1 b3 ws6 l5 bolt2)
   deleted: (loaded r1) (carries r1 b3)
   added: (atbw b3 ws6) (atbl b3 l5) (box_delivered b3 ws6) (ats bolt2 l5)
   goals met: 3 of 10
48. (empty_box r1 b4 valve2 l5 ws6)
   deleted: (contains b4 valve2) (ats valve2 l5)
   added: (empty b4) (has ws6 valve2)
   goals met: 3 of 10
49. (move_robot r1 l5 l4)
   deleted: (free l4) (atr r1 l5)
   added: (free l5) (atr r1 l4)
   goals met: 3 of 10
50. (valve_acquired ws6 valve2)
   added: (has_valve ws6)
   goals met: 4 of 10
51. (fill_box r1 b4 tool2 l4)
   deleted: (empty b4) (ats tool2 l4)
   added: (contains b4 tool2)
   goals met: 4 of 10
52. (pick_box_from_wa r1 b4 l4)
   deleted: (atbl b4 l4)
   added: (carries r1 b4) (loaded r1)
   goals met: 4 of 10
53. (move_box_and_robot r1 l4 l5 b4)
   deleted: (free l5) (atr r1 l4)
   added: (free l4) (atr r1 l5)
   goals met: 4 of 10
54. (move_box_and_robot r1 l5 l4 b4)
   deleted: (free l4) (atr r1 l5)
   added: (free l5) (atr r1 l4) (atbl b4 l4)
   goals met: 4 of 10
55. (move_box_and_robot r1 l4 l5 b4)
   deleted: (free l5) (atr r1 l4)
   added: (free l4) (atr r1 l5)
   goals met: 4 of 10
56. (deliver_box_to_ws r1 b4 ws6 l5 tool2)
   deleted: (loaded r1) (carries r1 b4)
   added: (ats tool2 l5)
   goals met: 4 of 10
57. (empty_box r1 b4 tool2 l5 ws6)
   deleted: (contains b4 tool2) (ats tool2 l5)
   added: (empty b4) (has ws6 tool2)
   goals met: 4 of 10
58. (tool_acquired ws6 tool2)
   added: (has_tool ws6)
   goals met: 5 of 10
59. (move_robot r1 l5 l4)
   deleted: (free l4) (atr r1 l5)
   added: (free l5) (atr r1 l4)
   goals met: 5 of 10
60. (move_robot r1 l4 l3)
   deleted: (free l3) (atr r1 l4)
   added: (free l4) (atr r1 l3)
   goals met: 5 of 10
61. (pick_box_from_wa r1 b6 l3)
   deleted: (atbl b6 l3)
   added: (carries r1 b6) (loaded r1)
   goals met: 5 of 10
62. (move_box_and_robot r1 l3 l4 b6)
   deleted: (free l4) (atr r1 l3)
   added: (free l3) (atr r1 l4)
   goals met: 5 of 10
63. (deliver_box_to_ws r1 b6 ws4 l4 tool2)
   deleted: (loaded r1) (carries r1 b6)
   added: (ats tool2 l4)
   goals met: 5 of 10
64. (empty_box r1 b6 tool2 l4 ws4)
   deleted: (contains b6 tool2) (ats tool2 l4)
   added: (empty b6) (has ws4 tool2)
   goals met: 5 of 10
65. (tool_acquired ws4 tool2)
   added: (has_tool ws4)
   goals met: 6 of 10
66. (move_robot r1 l4 l3)
   deleted: (free l3) (atr r1 l4)
   added: (free l4) (atr r1 l3)
   goals met: 6 of 10
67. (move_robot r2 l2 centralwarehouse)
   deleted: (free centralwarehouse) (atr r2 l2)
   added: (free l2) (atr r2 centralwarehouse)
   goals met: 6 of 10
68. (pick_box_from_wa r2 b3 centralwarehouse)
   deleted: (atbl b3 centralwarehouse)
   added: (carries r2 b3) (loaded r2)
   goals met: 6 of 10
69. (move_box_and_robot r2 centralwarehouse l2 b3)
   deleted: (free l2) (atr r2 centralwarehouse)
   added: (free centralwarehouse) (atr r2 l2) (atbl b3 l2)
   goals met: 6 of 10
70. (deliver_box_to_ws r2 b3 ws2 l2 bolt2)
   deleted: (loaded r2) (carries r2 b3)
   added: (atbw b3 ws2) (box_delivered b3 ws2) (ats bolt2 l2)
   goals met: 6 of 10
71. (move_robot r1 l3 centralwarehouse)
   deleted: (free centralwarehouse) (atr r1 l3)
   added: (free l3) (atr r1 centralwarehouse)
   goals met: 7 of 10
72. (empty_box r2 b3 bolt2 l2 ws2)
   deleted: (contains b3 bolt2) (ats bolt2 l2)
   added: (empty b3) (has ws2 bolt2)
   goals met: 7 of 10
73. (bolt_acquired ws2 bolt2)
   added: (has_bolt ws2)
   goals met: 8 of 10
74. (move_robot r1 centralwarehouse l3)
   deleted: (free l3) (atr r1 centralwarehouse)
   added: (free centralwarehouse) (atr r1 l3)
   goals met: 7 of 10
75. (move_robot r1 l3 l4)
   deleted: (free l4) (atr r1 l3)
   added: (free l3) (atr r1 l4)
   goals met: 7 of 10
76. (fill_box r1 b4 bolt2 l4)
   deleted: (empty b4) (ats bolt2 l4)
   added: (contains b4 bolt2)
   goals met: 7 of 10
77. (pick_box_from_wa r1 b4 l4)
   deleted: (atbl b4 l4)
   added: (carries r1 b4) (loaded r1)
   goals met: 7 of 10
78. (deliver_box_to_ws r1 b4 ws5 l4 bolt2)
   deleted: (loaded r1) (carries r1 b4)
   added: (atbw b4 ws5) (atbl b4 l4) (box_delivered b4 ws5) (ats bolt2 l4)
   goals met: 7 of 10
79. (empty_box r1 b4 bolt2 l4 ws5)
   deleted: (contains b4 bolt2) (ats bolt2 l4)
   added: (empty b4) (has ws5 bolt2)
   goals met: 7 of 10
80. (bolt_acquired ws5 bolt2)
   added: (has_bolt ws5)
   goals met: 8 of 10
81. (move_robot r1 l4 l3)
   deleted: (free l3) (atr r1 l4)
   added: (free l4) (atr r1 l3)
   goals met: 8 of 10
82. (pick_box_from_wa r1 b4 l3)
   deleted: (atbl b4 l3)
   added: (carries r1 b4) (loaded r1)
   goals met: 8 of 10
83. (move_box_and_robot r1 l3 centralwarehouse b4)
   deleted: (free centralwarehouse) (atr r1 l3)
   added: (free l3) (atr r1 centralwarehouse) (atbl b4 centralwarehouse)
   goals met: 9 of 10
84. (fill_box r1 b4 bolt3 centralwarehouse)
   deleted: (empty b4) (ats bolt3 centralwarehouse)
   added: (contains b4 bolt3)
   goals met: 9 of 10
85. (move_box_and_robot r1 centralwarehouse l3 b4)
   deleted: (free l3) (atr r1 centralwarehouse)
   added: (free centralwarehouse) (atr r1 l3) (atbl b4 l3)
   goals met: 8 of 10
86. (move_box_and_robot r1 l3 l4 b4)
   deleted: (free l4) (atr r1 l3)
   added: (free l3) (atr r1 l4)
   goals met: 8 of 10
87. (move_box_and_robot r1 l4 l5 b4)
   deleted: (free l5) (atr r1 l4)
   added: (free l4) (atr r1 l5)
   goals met: 8 of 10
88. (deliver_box_to_ws r1 b4 ws6 l5 bolt3)
   deleted: (loaded r1) (carries r1 b4)
   added: (ats bolt3 l5)
   goals met: 8 of 10
89. (empty_box r1 b4 bolt3 l5 ws6)
   deleted: (contains b4 bolt3) (ats bolt3 l5)
   added: (empty b4) (has ws6 bolt3)
   goals met: 8 of 10
90. (move_robot r1 l5 l4)
   deleted: (free l4) (atr r1 l5)
   added: (free l5) (atr r1 l4)
   goals met: 8 of 10
91. (move_robot r1 l4 l3)
   deleted: (free l3) (atr r1 l4)
   added: (free l4) (atr r1 l3)
   goals met: 8 of 10
92. (move_robot r1 l3 centralwarehouse)
   deleted: (free centralwarehouse) (atr r1 l3)
   added: (free l3) (atr r1 centralwarehouse)
   goals met: 9 of 10
93. (bolt_acquired ws6 bolt3)
   added: (has_bolt ws6)
   goals met: 10 of 10
